Tekla.Structures.Drawing.UI.IUIEventsInternal.LayoutEditingModeEntered
The LayoutEditingModeEntered event is raised when layout editing mode is started.

Tekla.Structures.Drawing.UI.IUIEventsInternal.LayoutEditingModeExited
The LayoutEditingModeEntered event is raised when layout editing mode is finished.

Tekla.Structures.Drawing.UI.IUIEventsInternal.LayoutTableInserted
The event is raised when table is inserted

Tekla.Structures.Drawing.UI.IUIEventsInternal.LayoutTableModified
The event is never raised

Tekla.Structures.Drawing.UI.IUIEventsInternal.LayoutTableDeleted
The event is raised when table is deleted

Tekla.Structures.Drawing.UI.IUIEventsInternal.LayoutTableLayoutModified
The event is raised when tablelayout is modified

Tekla.Structures.Drawing.UI.IUIEventsInternal.LayoutOptionModified
The event is raised when layout option is modified

Tekla.Structures.Drawing.UI.IUIEventsInternal.OnLayoutEditingModeEntered(System.String,System.Object[])


Tekla.Structures.Drawing.UI.IUIEventsInternal.OnLayoutEditingModeExited(System.String,System.Object[])


Tekla.Structures.Drawing.UI.IUIEventsInternal.OnLayoutTableDeleted(System.String,System.Object[])


Tekla.Structures.Drawing.UI.IUIEventsInternal.OnLayoutTableInserted(System.String,System.Object[])


Tekla.Structures.Drawing.UI.IUIEventsInternal.OnLayoutTableModified(System.String,System.Object[])


Tekla.Structures.Drawing.UI.IUIEventsInternal.OnLayoutTableLayoutModified(System.String,System.Object[])


Tekla.Structures.Drawing.UI.IUIEventsInternal.OnLayoutOptionModified(System.String,System.Object[])
